Show / Hide Table of Contents
Class LineLoad
Line load
Inheritance
System.Object
OpenObject
LoadBase
LineLoad
Inherited Members
 LoadBase.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
public class LineLoad : LoadBase
Constructors
Improve this Doc   View Source
LineLoad()
constructor
Declaration
public LineLoad()
Properties
Improve this Doc   View Source
Angle
angle of load
Declaration
public double Angle { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BegFx
force in X at biginning
Declaration
public double BegFx { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BegFy
force in Y at beginning
Declaration
public double BegFy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BegPositionX
point support position X
Declaration
public double BegPositionX { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
BegPositionY
point support position Y
Declaration
public double BegPositionY { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Direction
local / global
Declaration
public LoadDirection Direction { get; set; }
Property Value
 Type |  Description
 LoadDirection
Improve this Doc   View Source
DirectionType
direction type of load
Declaration
public DirectionType DirectionType { get; set; }
Property Value
 Type |  Description
 DirectionType
Improve this Doc   View Source
EdgePositionType
edge position type
Declaration
public EdgeOrientationType EdgePositionType { get; set; }
Property Value
 Type |  Description
 EdgeOrientationType
Improve this Doc   View Source
EndFx
force in X at end
Declaration
public double EndFx { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
EndFy
force in Y at end
Declaration
public double EndFy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
EndPositionX
point support position X
Declaration
public double EndPositionX { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
EndPositionY
point support position Y
Declaration
public double EndPositionY { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
GeneralLine
general shape
Declaration
public PolyLine2D GeneralLine { get; set; }
Property Value
 Type |  Description
 PolyLine2D
Improve this Doc   View Source
GeometryPointsPath
list of line load points
Declaration
public Polygon2D GeometryPointsPath { get; set; }
Property Value
 Type |  Description
 Polygon2D
Improve this Doc   View Source
LengthOnEdge
length of load
Declaration
public double LengthOnEdge { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MasterComponent
Gets or sets the master component
Declaration
public ReferenceElement MasterComponent { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
MasterEdge
master component edge
Declaration
public int MasterEdge { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
MasterPoint
master point
Declaration
public int MasterPoint { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
Name
Gets or set the name
Declaration
public string Name { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
PositionOnEdge
position od edge
Declaration
public double PositionOnEdge { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
ResultantForces
forces value
Declaration
public string ResultantForces { get; set; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
TypeEdgePosition
edge position type
Declaration
public TypeEdgePosition TypeEdgePosition { get; set; }
Property Value
 Type |  Description
 TypeEdgePosition
Improve this Doc   View Source
TypeLinePosition
type of position
Declaration
public TypeLinePosition TypeLinePosition { get; set; }
Property Value
 Type |  Description
 TypeLinePosition
 Improve this Doc
 View Source